// ДОМАШНЄ ЗАВДАННЯ 
// 1.  
// Зробити змінну типу масив, довжиною 100 елеменнтів. Заповнити його випадковими числами від 0 до 100 включно. 
// Написати функцію, яка буде створювати новий массив, в якому усі його елменти будуть: 
//   а) відсортовані по зростанню 
//   б) усі елементи будуть більше ніж 50 


  let arr1 = [];
  for (i = 0; i <= 99; i++){
      arr1.push(Math.round(Math.random()*100));
  }
    console.log(arr1);
    arr2 = arr1.sort(sortArray).filter((el) => el > 50); 
    function sortArray(a, b){
      return a - b;
  }
    console.log(arr2);
 
// 2.  
// Зробити змінну типу масив, довжиною 100 елеменнтів. Заповнити його випадковими строками з літерами англійского алфавіту. 
// Написати функцію, яка буде створювати новий массив, в якому усі його елменти будуть: 
//   а) відсортовані по зростанню 
//   б) усі елемени будуть перетворені у об'єкт типу  
//       { 
//         value: значення з елементу масива 
//       } 
 
let arr1 = [],
    str = 'abcdefghijklmnopqrstuvwxyz',
    strLength = str.length;
    for (i = 0; i <= 99; i++) {
        arr1.push(str.charAt(Math.random() * strLength));
    } 
    function alphabet() {
        arr2 = arr1.sort();
        arr2 = {...arr1};
        
    }
    alphabet();
    console.log(arr2);
    
 
 
// 3. 
// Компанія розробляє календар зайнятості своїх співробітників. Календар зберігається у форматі об'єктов з властивостями: 
// startTime (час початку, коли співробітник зайнятий) та endTime (час закінчення, коли співробітник зайнятий) - число з точністю до 30 хвилин, де  
//   0 - це час, який дорівнює 00:00  
//   1 - це час, який дорівнює 00:30  
//   2 - це час, який дорівнює 01:00 
//   3 - це час, який дорівнює 01:30 
// і так далі. 
 
 
// Потрібно написати функцію mergeRanges, яка отримує масив об'єктів зайнятості співробітника, та поверне чистий час, коли співробітник зайнятий. 
 
// Наприклад, у співробітника зареєстровано зайнятість 
// [ 
//   { startTime: 0, endTime: 1 }, 
//   { startTime: 3, endTime: 5 }, 
//   { startTime: 4, endTime: 8 }, 
//   { startTime: 10, endTime: 12 }, 
//   { startTime: 9, endTime: 10 }, 
// ] 
// потрібно розрахувати чистий час, коли співробітник зайнятий, тобто: 
// [ 
//   { startTime: 0, endTime: 1 }, 
//   { startTime: 3, endTime: 8 }, 
//   { startTime: 9, endTime: 12 } 
// ]

// let calendar = {startTime: 0, endTime: 0};
// function mergeRanges(startTime, endTime) {
    
// }
// mergeRanges(4, 7);
// mergeRanges(1, 3);
// mergeRanges(3, 5);
// mergeRanges(4, 9);


//Это задание в процессе выполнения. Пока только алгоритм.
/*
1-в каждом объекте вывести весь часовой диапазон от startTime  до endTime:
        0,1
        3,4,5
        4,5,6,7,8
        10,11,12
        9,10
2-Сравнить на совпадения каждую строку друг с другом. Если нет,тогда оставить без изменений. А если есть совпадения, тогда объединить две строки совпадающими элементами в одну, а дублирующиеся елементы удалить. Вывести результат.
        0,1
        3,4,5,6,7,8
        9,10,11,12
        

3-Вывести результат в виде объекта.
        startTime: 0, endTime: 1
        startTime: 3, endTime: 8  
        startTime: 9, endTime: 12
*/        